## Missing Values
Which column has the highest number of missing values in the hiring data?

In [1]:
import pandas as pd
import numpy as np

In [2]:
hiring_data_df = pd.read_csv('hiring_data.csv')

In [11]:
missing_value_columns = hiring_data_df.isnull().sum()

In [13]:
missing_value_columns.sort_values(ascending=False, inplace=True)

How many columns in the given data have more than 5 missing values?

In [18]:
missing_value_columns[missing_value_columns > 5]

salary            27
specialization    11
workex             8
degree_b           7
dtype: int64

How many rows in the given data have more than four missing values?

In [46]:
hiring_data_df.loc[(hiring_data_df.isnull().sum(axis=1) > 4), :]

,gender,degree_p,degree_b,workex,etest_p,specialization,mba_p,status,salary
17,NaN,64.0,NaN,NaN,60.0,NaN,67.28,NaN,182000.0
20,NaN,72.0,NaN,NaN,NaN,NaN,78.90,NaN,123700.0
26,F,NaN,NaN,NaN,76.0,NaN,65.33,Not Placed,NaN

### Drop the Rows

After finding the number of missing values, you decide to remove those rows that have more than four missing values. \
After removing these rows, what will be the average salary of the students who are hired?

In [52]:
hiring_data_df.shape

(99, 9)

In [67]:
round(hiring_data_df.dropna(thresh=5)['salary'].mean(), 2)

131261.43